---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricSheetType
source: html/892f0ce6-5548-d299-c976-9355ac4109ee.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType

Represents a fabric sheet type, used in the generation of fabric wires.

## Syntax (C#)
```csharp
public class FabricSheetType : ElementType
```